vuhoang2003/MCU_tem_hum/Robotbase_Sen/TivaWare_C/projects/sensor_boards/mcu_tm4c123gxl/usb_dev_serial/usb_dev_serial.c
#define 	RD_T_H		1
#define 	RD_RPY		2
#define 	RD_CO2		3
float nhiet_do,do_am;
unsigned int Usb_Write_Num=0;
unsigned int Usb_Read_Num=0;
unsigned char Usb_Rec_Buff[MAX_USB_REC_BUFF]={0};
char L_Receive_Buf[100]={0};
unsigned char CMD_REQ=0;


static void UIUsbcanReceive(void)
{
    unsigned int ucSize;
    unsigned long ulIdx;

    //
    // Loop while there is data in the receive buffer.
    //
    while(Usb_Read_Num != Usb_Write_Num)
    {
        //
        // See if this character is the tag for the start of a command packet.
        //
        if(!((Usb_Rec_Buff[Usb_Read_Num] == 'R')&&
				(Usb_Rec_Buff[(Usb_Read_Num+1)%MAX_USB_REC_BUFF] == 'D')))
        {
            //
            // Skip this character.
            //
            Usb_Read_Num = (Usb_Read_Num + 1) % MAX_USB_REC_BUFF;

            //
            // Keep scanning for a start of command packet tag.
            //
            continue;
        }

        //
        // See if there are additional characters in the receive buffer.
        //
        if(((Usb_Read_Num + 2) % MAX_USB_REC_BUFF) == Usb_Write_Num)
        {
            //
            // There are no additional characters in the receive buffer after
            // the start of command packet byte, so stop scanning for now.
            //
            break;
        }

        //
        // See if the packet size byte is valid.  A command packet must be at
        // least four bytes and can not be larger than the receive buffer size.
        //
        ucSize = Usb_Rec_Buff[(Usb_Read_Num + 2) %  MAX_USB_REC_BUFF]-0x30;// length of pack from 5 to 9
        if((ucSize < 4) || (ucSize > (MAX_USB_REC_BUFF - 1)))
        {
            //
            // The packet size is too large, so either this is not the start of
            // a packet or an invalid packet was received.  Skip this start of
            // command packet tag.
            //
            Usb_Read_Num =
                (Usb_Read_Num + 2) % MAX_USB_REC_BUFF;

            //
            // Keep scanning for a start of command packet tag.
            //
            continue;
        }

        //
        // Determine the number of bytes in the receive buffer.
        //
        ulIdx = Usb_Write_Num - Usb_Read_Num;
        if(Usb_Read_Num > Usb_Write_Num)
        {
            ulIdx += MAX_USB_REC_BUFF;
        }

        //
        // If the entire command packet is not in the receive buffer then stop
        // scanning for now.
        //
        if(ulIdx < ucSize)
        {
            break;
        }	
		for(ulIdx = 0; ulIdx < ucSize; ulIdx++)
		{
			L_Receive_Buf[ulIdx] = Usb_Rec_Buff[(Usb_Read_Num + ulIdx) % MAX_USB_REC_BUFF];
		}
		if (strncmp (&L_Receive_Buf[3],"TnH",ucSize-3) == 0)
		{
			CMD_REQ = RD_T_H;
			USBBufferWrite((tUSBBuffer *)&g_sTxBuffer, (unsigned char *)Mybuff, count_str);
		}
		else if (strncmp (&L_Receive_Buf[3],"RPY",ucSize-3) == 0)
		{
			CMD_REQ = RD_RPY;
		}
		else if (strncmp (&L_Receive_Buf[3],"CO2",ucSize-3) == 0)
		{
			CMD_REQ = RD_RPY;
		}
		else
		{	
			Usb_Read_Num = (Usb_Read_Num + 2) % MAX_USB_REC_BUFF;
			// Keep scanning for a start of command packet tag.
			continue;				
		}
		TOGGLE_LED_REC;		
        //
        // Skip this command packet.
        //
        Usb_Read_Num = (Usb_Read_Num + ucSize) % MAX_USB_REC_BUFF;
    }
}

void CMD_Process(void)
{
	
	switch (CMD_REQ)
	{
		case RD_T_H:
		{			
			USBBufferWrite((tUSBBuffer *)&g_sTxBuffer, "Hello", 5);
			CMD_REQ = 0;
			break;
		}
		case RD_RPY:
		{
			CMD_REQ = 0;
			break;
		}
		case RD_CO2:
		{
			CMD_REQ = 0;
			break;
		}
		default:
		{
			CMD_REQ = 0;
			break;
		}
	}
}


//*****************************************************************************
//
// Internal function prototypes.
//
//*****************************************************************************
static void USBUARTPrimeTransmit(uint32_t ui32Base);
static void CheckForSerialStateChange(const tUSBDCDCDevice *psDevice,
                                      int32_t i32Errors);
static void SetControlLineState(uint16_t ui16State);
static bool SetLineCoding(tLineCoding *psLineCoding);
static void GetLineCoding(tLineCoding *psLineCoding);
static void SendBreak(bool bSend);

//*****************************************************************************
//
// The error routine that is called if the driver library encounters an error.
//
//*****************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
    while(1)
    {
    }
}
#endif

//*****************************************************************************
//
// This function is called whenever serial data is received from the UART.
// It is passed the accumulated error flags from each character received in
// this interrupt and determines from them whether or not an interrupt
// notification to the host is required.
//
// If a notification is required and the control interrupt endpoint is idle,
// we send the notification immediately.  If the endpoint is not idle, we
// accumulate the errors in a global variable which will be checked on
// completion of the previous notification and used to send a second one
// if necessary.
//
//*****************************************************************************
static void
CheckForSerialStateChange(const tUSBDCDCDevice *psDevice, int32_t i32Errors)
{
    uint16_t ui16SerialState;

    //
    // Clear our USB serial state.  Since we are faking the handshakes, always
    // set the TXCARRIER (DSR) and RXCARRIER (DCD) bits.
    //
    ui16SerialState = USB_CDC_SERIAL_STATE_TXCARRIER |
                    USB_CDC_SERIAL_STATE_RXCARRIER;

    //
    // Are any error bits set?
    //
    if(i32Errors)
    {
        //
        // At least one error is being notified so translate from our hardware
        // error bits into the correct state markers for the USB notification.
        //
        if(i32Errors & UART_DR_OE)
        {
            ui16SerialState |= USB_CDC_SERIAL_STATE_OVERRUN;
        }

        if(i32Errors & UART_DR_PE)
        {
            ui16SerialState |= USB_CDC_SERIAL_STATE_PARITY;
        }

        if(i32Errors & UART_DR_FE)
        {
            ui16SerialState |= USB_CDC_SERIAL_STATE_FRAMING;
        }

        if(i32Errors & UART_DR_BE)
        {
            ui16SerialState |= USB_CDC_SERIAL_STATE_BREAK;
        }

